Sudrien/m5tab5_esp_idf_m135_examples/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# Required for rev v1.3 silicon; without it esptool refuses to flash.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_200M=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_LOG_DYNAMIC_LEVEL_CONTROL=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

CONFIG_FREERTOS_HZ=1000
